Tekla.Structures.DrawingInternal.CDelegateSynchronized
CDelegateSynchronized includes all the platform invokable commands and synchronization to AKIT.

Tekla.Structures.DrawingInternal.CDelegateSynchronized.#ctor


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportLineHandler(Tekla.Structures.DrawingInternal.dotGrLine_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportArcHandler(Tekla.Structures.DrawingInternal.dotGrArc_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportPolylineHandler(Tekla.Structures.DrawingInternal.dotGrPolyline_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportPolygonHandler(Tekla.Structures.DrawingInternal.dotGrPolygon_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportCloudHandler(Tekla.Structures.DrawingInternal.dotGrCloud_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportRectangularCloudHandler(Tekla.Structures.DrawingInternal.dotGrRectangularCloud_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportRectangleHandler(Tekla.Structures.DrawingInternal.dotGrRectangle_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportHatchLineHandler(Tekla.Structures.DrawingInternal.dotGrHatchLine_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportCircleHandler(Tekla.Structures.DrawingInternal.dotGrCircle_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportOpenGraphicObjectAttributesHandler(Tekla.Structures.DrawingInternal.dotGrOpenGraphicObjectAttributes_t@,System.Int32)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportClosedGraphicObjectAttributesHandler(Tekla.Structures.DrawingInternal.dotGrClosedGraphicObjectAttributes_t@,System.Int32)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportHatchLineAttributesHandler(Tekla.Structures.DrawingInternal.dotGrHatchLineAttributes_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportPointListHandler(Tekla.Structures.DrawingInternal.dotGrPointList_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ImportPointListHandler(Tekla.Structures.DrawingInternal.dotGrPointList_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportIntListHandler(Tekla.Structures.DrawingInternal.dotGrIntList_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ImportIntListHandler(Tekla.Structures.DrawingInternal.dotGrIntList_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportDoubleListHandler(Tekla.Structures.DrawingInternal.dotGrDoubleList_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ImportDoubleListHandler(Tekla.Structures.DrawingInternal.dotGrDoubleList_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportStringListHandler(Tekla.Structures.DrawingInternal.dotGrStringList_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ImportStringListHandler(Tekla.Structures.DrawingInternal.dotGrStringList_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportMarkElementListHandler(Tekla.Structures.DrawingInternal.dotGrElementList_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ImportMarkElementListHandler(Tekla.Structures.DrawingInternal.dotGrElementList_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportGetColorIndexFromARGB(Tekla.Structures.DrawingInternal.dotARGBColor_t@)
Inserts the specified ARGB into the global color map and returns its index.
ARGB: Color structure defining alpha, red, green, blue values.
Returns: The TS globally unique color index.

Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportGetARGBFromColorIndex(System.Int32,Tekla.Structures.DrawingInternal.dotARGBColor_t@)
Gets the ARGB struct corresponding to the ColorIndex.
ColorIndex: TS globally unique color index.
ARGB: Color structure defining alpha, red, green, blue values (output).
Returns: true.

Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportIsStandardColor(System.Int32)
Returns true if the color referenced by ColorIndex is a TS standard color.
Otherwise it is a user defined color.
ColorIndex: TS globally unique color index.
Returns: Non-zero value if the input color is a standard TS color. Zero if it is a user defined color

Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportGetColorIndexFromSaveFormat(System.String)
Returns the global TS color index for the input string (color).
SaveFormat: Color save format (hex ie 0xFF140413 or TS standard color index).
Returns: The TS globally unique color index.

Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportGetSaveFormatFromColorIndex(System.Int32,System.String@)
Returns the save format for the ColorIndex.
ColorIndex: TS globally unique color index.
SaveFormat: desired save format for colors (output).
Returns: result of dotExportGetSaveFormatFromColorIndex.

Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportGetAllColorPaletteFiles(Tekla.Structures.DrawingInternal.dotClientId_t)
Returns a list of all color palette files available for this model,
based on the normal file visibility rule.
DotClientId: client id
Returns: results

Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportGetDrawingToObjectMapping(Tekla.Structures.DrawingInternal.dotClientId_t)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportGridHandler(Tekla.Structures.DrawingInternal.dotGrGrid_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportGridAttributesHandler(Tekla.Structures.DrawingInternal.dotGrGridAttributes_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportGridLineHandler(Tekla.Structures.DrawingInternal.dotGrGridLine_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportGridLineAttributesHandler(Tekla.Structures.DrawingInternal.dotGrGridLineAttributes_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportViewHandler(Tekla.Structures.DrawingInternal.dotGrView_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportEnumerateObjects(Tekla.Structures.DrawingInternal.dotEnumerator_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportGetSnapshotFromDatabase(Tekla.Structures.DrawingInternal.dotEnumerator_t@,System.Collections.Generic.List{System.Object}@,System.Boolean)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportPartHandler(Tekla.Structures.DrawingInternal.dotGrPart_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportPartAttributesHandler(Tekla.Structures.DrawingInternal.dotGrPartAttributes_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportBoltHandler(Tekla.Structures.DrawingInternal.dotGrBolt_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportBoltAttributesHandler(Tekla.Structures.DrawingInternal.dotGrBoltAttributes_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportEdgeChamferHandler(Tekla.Structures.DrawingInternal.dotGrEdgeChamfer_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportEdgeChamferAttributesHandler(Tekla.Structures.DrawingInternal.dotGrEdgeChamferAttributes_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportPourHandler(Tekla.Structures.DrawingInternal.dotGrPour_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportPourAttributesHandler(Tekla.Structures.DrawingInternal.dotGrPourAttributes_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportPourBreakHandler(Tekla.Structures.DrawingInternal.dotGrPourBreak_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportPourBreakAttributesHandler(Tekla.Structures.DrawingInternal.dotGrPourBreakAttributes_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportConnectionHandler(Tekla.Structures.DrawingInternal.dotGrConnection_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportReinforcementHandler(Tekla.Structures.DrawingInternal.dotGrReinforcementBase_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportReinforcementSetGroupGetModelIdentifiers(Tekla.Structures.DrawingInternal.dotGrReinforcementSetGroupIdentifiers_t@,System.Collections.Generic.List{System.Int32}@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportSurfacingHandler(Tekla.Structures.DrawingInternal.dotGrSurfacing_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportSurfacingAttributesHandler(Tekla.Structures.DrawingInternal.dotGrSurfacingAttributes_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportWeldHandler(Tekla.Structures.DrawingInternal.dotGrWeld_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportWeldAttributesHandler(Tekla.Structures.DrawingInternal.dotGrWeldAttributes_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportWeldMarkHandler(Tekla.Structures.DrawingInternal.dotGrWeldMark_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportWeldMarkAttributesHandler(Tekla.Structures.DrawingInternal.dotGrWeldMarkAttributes_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportTextHandler(Tekla.Structures.DrawingInternal.dotGrText_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportTextAttributesHandler(Tekla.Structures.DrawingInternal.dotGrTextAttributes_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.PerformActionUsingPluginFormFullName(System.String,System.String,System.Func{System.String,System.String,System.Boolean})


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportPluginHandler(Tekla.Structures.DrawingInternal.dotGrPlugin_t@,System.String@,System.Boolean)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportEmbeddedObjectHandler(Tekla.Structures.DrawingInternal.dotGrEmbeddedObject_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportEmbeddedObjectAttributesHandler(Tekla.Structures.DrawingInternal.dotGrEmbeddedObjectAttributes_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportReferenceModelHandler(Tekla.Structures.DrawingInternal.dotGrReferenceModel_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportReferenceModelAttributesHandler(Tekla.Structures.DrawingInternal.dotGrReferenceModelAttributes_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportTextFileHandler(Tekla.Structures.DrawingInternal.dotGrTextFile_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportTextFileAttributesHandler(Tekla.Structures.DrawingInternal.dotGrTextFileAttributes_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportLinkHandler(Tekla.Structures.DrawingInternal.dotGrLink_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportLinkAttributesHandler(Tekla.Structures.DrawingInternal.dotGrLinkAttributes_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportDrawingHandler(Tekla.Structures.DrawingInternal.dotGrDrawingAttributes_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportDrawingHandlerHandler(Tekla.Structures.DrawingInternal.dotGrDrawingHandler_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportGetIdsForDrawingsNeedingNumbering(Tekla.Structures.DrawingInternal.dotClientId_t)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportLayoutHandler(Tekla.Structures.DrawingInternal.dotGrLayoutHandler_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportMarkLearningHandler(Tekla.Structures.DrawingInternal.dotGrMarkLearningHandler_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportMarkListingHandler(Tekla.Structures.DrawingInternal.dotGrMarkListingHandler_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportOperationHandler(Tekla.Structures.DrawingInternal.dotGrOperationHandler_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportAssociativityHandler(Tekla.Structures.DrawingInternal.dotGrAssociativityHandler_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportCloningHandler(Tekla.Structures.DrawingInternal.dotGrCloningHandler_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportPrintDrawingHandler(Tekla.Structures.DrawingInternal.dotGrPrintDrawing_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportUserPropertyHandler(Tekla.Structures.DrawingInternal.dotGrUserProperty_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportModelDatabaseUserPropertyHandler(Tekla.Structures.DrawingInternal.dotGrUserProperty_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportStraightDimensionHandler(Tekla.Structures.DrawingInternal.dotGrStraightDimension_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportStraightDimensionSetHandler(Tekla.Structures.DrawingInternal.dotGrStraightDimensionSet_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportStraightDimensionSetExcludePartsAccordingToFilter(Tekla.Structures.DrawingInternal.dotGrDrawingObject_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportStraightDimensionSetAttributesHandler(Tekla.Structures.DrawingInternal.dotGrStraightDimensionSetAttributes_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportDimensionLinkHandler(Tekla.Structures.DrawingInternal.dotGrDimensionLink_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportDrawingCheckerFetchCurrentDrawingErrors(System.Int32,System.Collections.Generic.List{System.Int32}@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportAngleDimensionHandler(Tekla.Structures.DrawingInternal.dotGrAngleDimension_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportAngleDimensionAttributesHandler(Tekla.Structures.DrawingInternal.dotGrAngleDimensionAttributes_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportRadiusDimensionHandler(Tekla.Structures.DrawingInternal.dotGrRadiusDimension_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportRadiusDimensionAttributesHandler(Tekla.Structures.DrawingInternal.dotGrRadiusDimensionAttributes_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportCurvedDimensionRadialHandler(Tekla.Structures.DrawingInternal.dotGrCurvedDimensionRadial_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportCurvedDimensionSetRadialHandler(Tekla.Structures.DrawingInternal.dotGrCurvedDimensionSetRadial_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportCurvedDimensionSetRadialAttributesHandler(Tekla.Structures.DrawingInternal.dotGrCurvedDimensionSetRadialAttributes_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportCurvedDimensionOrthogonalHandler(Tekla.Structures.DrawingInternal.dotGrCurvedDimensionOrthogonal_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportCurvedDimensionSetOrthogonalHandler(Tekla.Structures.DrawingInternal.dotGrCurvedDimensionSetOrthogonal_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportCurvedDimensionSetOrthogonalAttributesHandler(Tekla.Structures.DrawingInternal.dotGrCurvedDimensionSetOrthogonalAttributes_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportMarkHandler(Tekla.Structures.DrawingInternal.dotGrMarkBase_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportGetDotType(Tekla.Structures.DrawingInternal.dotGrDrawingObject_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportMarkAttributesHandler(Tekla.Structures.DrawingInternal.dotGrMarkBaseAttributes_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.EndInvoke(Tekla.Structures.DrawingInternal.dotDrawingUIPicker_t@,System.IAsyncResult)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportPickerHandler(Tekla.Structures.DrawingInternal.dotDrawingUIPickerWrapper_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportDrawingObjectSelectorHandler(Tekla.Structures.DrawingInternal.dotDrawingObjectSelector_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportViewAttributesHandler(Tekla.Structures.DrawingInternal.dotGrViewAttributes_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.GetDrawingViewVisibilityFilterValue(System.Int32,System.String@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.GetRaiseReadWindowsNamesByViewIds(System.Int32,System.Int32)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportSymbolHandler(Tekla.Structures.DrawingInternal.dotGrSymbol_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportSymbolAttributesHandler(Tekla.Structures.DrawingInternal.dotGrSymbolAttributes_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportLevelMarkHandler(Tekla.Structures.DrawingInternal.dotGrLevelMark_t@)
Function to handle .Net side requests about level marks
pLevelMark: .Net Level Mark
Returns: Result of request

Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportLevelMarkAttributesHandler(Tekla.Structures.DrawingInternal.dotGrLevelMarkAttributes_t@)
Function to handle .Net side requests about level mark attributes
pLevelMarkAttributes: .Net Level Mark Attributes
Returns: Result of request

Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportAutomationHandler(Tekla.Structures.DrawingInternal.dotGrAutomation_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportLeaderLineHandler(Tekla.Structures.DrawingInternal.dotGrLeaderLine_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportReinforcementBaseAttributesHandler(Tekla.Structures.DrawingInternal.dotGrReinforcementBaseAttributes_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportAssociativityRuleHandler(Tekla.Structures.DrawingInternal.dotGrAssociativity_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportDetailMarkHandler(Tekla.Structures.DrawingInternal.dotGrDetailMark_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportDetailMarkAttributesHandler(Tekla.Structures.DrawingInternal.dotGrDetailMarkAttributes_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportSectionMarkHandler(Tekla.Structures.DrawingInternal.dotGrSectionMark_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportSectionMarkAttributesHandler(Tekla.Structures.DrawingInternal.dotGrSectionMarkAttributes_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportViewCommandHandler(Tekla.Structures.DrawingInternal.dotGrViewCommand_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportPluginQueueHandler(Tekla.Structures.DrawingInternal.dotGrPluginQueue_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportPickerCommandHandler(Tekla.Structures.DrawingInternal.dotGrPickerCommand_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportEnumerateCustomLineTypes(Tekla.Structures.DrawingInternal.dotGrCustomLineTypes_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportGetChangedDrawingForUpdatedEvent(Tekla.Structures.DrawingInternal.dotGrDrawingAttributes_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportGetDrawingReadyForIssuingChangeEvent(System.String@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportSetDrawingPlotDateById(System.Int32)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportGetNextModelObjectIdentifier(System.Int32@,System.Int32)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportUpdateSelectedDrawings


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportNumberDrawings


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportUpdateSelectedDrawingMarks


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportRecreateSelectedDrawings


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportDeleteSelectedDrawings


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportAddToMasterDrawingCatalog


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportCopySelectedDrawingsToNewSheet


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportHighlightGridLine(System.Int32)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportUnhighlightGridLine(System.Int32)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportHighlightPartInView(System.Int32,System.Int32)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportUnhighlightPartInView(System.Int32,System.Int32)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportHighlightCutInView(System.Int32,System.Int32,System.Int32)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportUnhighlightCutInView(System.Int32)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportShowAssociativityPinPushed(System.Int32,System.Int32)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportShowAssociativityPinUnpushed(System.Int32,System.Int32)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportTryOpenDrawing(System.Int32)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportGetNumberOfNonUpToDateObjectsAndPours


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportGetEditMode


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportGetDrawingExportFileName(System.Int32,System.String,System.String,System.Boolean,System.Boolean,System.Boolean,System.String@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportGetDrawingExportFileNameExt(System.Int32,System.String,System.String,System.Int32,System.Boolean,System.Boolean,System.String@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportSelectPartsByDrawings


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportGetDrawingsBySelectedParts(Tekla.Structures.DrawingInternal.dotClientId_t,System.Boolean,System.Boolean)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportSetColorRgb(System.Int32,System.Byte,System.Byte,System.Byte)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportSetPenWidth(System.Int32,System.Int32)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportRefreshColorMode


Tekla.Structures.DrawingInternal.CDelegateSynchronized.GetDrawingRuntimeIdFromFilename(System.String)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportGetPluginInputById(System.Int32,Tekla.Structures.DrawingInternal.dotPluginInput_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportDisplayRevisionDialog


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportDisplayDrawingPropertiesDialog


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportArePoursShownInDrawing


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportDisplayDrawingUdaDialog


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportDisplayDrawingCloningDialog


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportDisplaySnapshotsDialog


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportDisplaySnapshotDialogByFileName(System.String)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportDisplaySnapshotsDialogByGuid(System.String)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportFilterDrawingListByParts


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportSignalDrawingSelectionChanged


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportSignalDocumentManagerClosed


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportSetDocumentManagerController(Tekla.Structures.DrawingInternal.IDocumentManagerController)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportGetDocumentManagerController(Tekla.Structures.DrawingInternal.IDocumentManagerController@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportShowColorPalette(System.Int32,System.IntPtr)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.ExportShowColorPaletteForHatchBackground(System.Int32,System.IntPtr)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotGrExportLineHandler(Tekla.Structures.DrawingInternal.dotGrLine_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotGrExportArcHandler(Tekla.Structures.DrawingInternal.dotGrArc_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotGrExportPolylineHandler(Tekla.Structures.DrawingInternal.dotGrPolyline_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotGrExportPolygonHandler(Tekla.Structures.DrawingInternal.dotGrPolygon_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotGrExportCloudHandler(Tekla.Structures.DrawingInternal.dotGrCloud_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotGrExportRectangularCloudHandler(Tekla.Structures.DrawingInternal.dotGrRectangularCloud_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotGrExportRectangleHandler(Tekla.Structures.DrawingInternal.dotGrRectangle_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotGrExportHatchLineHandler(Tekla.Structures.DrawingInternal.dotGrHatchLine_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotGrExportCircleHandler(Tekla.Structures.DrawingInternal.dotGrCircle_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotGrExportOpenGraphicObjectAttributesHandler(Tekla.Structures.DrawingInternal.dotGrOpenGraphicObjectAttributes_t@,System.Int32)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotGrExportClosedGraphicObjectAttributesHandler(Tekla.Structures.DrawingInternal.dotGrClosedGraphicObjectAttributes_t@,System.Int32)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotGrExportGridHandler(Tekla.Structures.DrawingInternal.dotGrGrid_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotGrExportGridAttributesHandler(Tekla.Structures.DrawingInternal.dotGrGridAttributes_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotGrExportGridLineHandler(Tekla.Structures.DrawingInternal.dotGrGridLine_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotGrExportGridLineAttributesHandler(Tekla.Structures.DrawingInternal.dotGrGridLineAttributes_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotGrExportPointListHandler(Tekla.Structures.DrawingInternal.dotGrPointList_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotGrImportPointListHandler(Tekla.Structures.DrawingInternal.dotGrPointList_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotGrExportIntListHandler(Tekla.Structures.DrawingInternal.dotGrIntList_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotGrImportIntListHandler(Tekla.Structures.DrawingInternal.dotGrIntList_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotGrExportDoubleListHandler(Tekla.Structures.DrawingInternal.dotGrDoubleList_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotGrImportDoubleListHandler(Tekla.Structures.DrawingInternal.dotGrDoubleList_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotGrExportStringListHandler(Tekla.Structures.DrawingInternal.dotGrStringList_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotGrImportStringListHandler(Tekla.Structures.DrawingInternal.dotGrStringList_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotGrExportMarkElementListHandler(Tekla.Structures.DrawingInternal.dotGrElementList_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotGrImportMarkElementListHandler(Tekla.Structures.DrawingInternal.dotGrElementList_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotGrExportViewHandler(Tekla.Structures.DrawingInternal.dotGrView_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotGrExportEnumeratorHandler(Tekla.Structures.DrawingInternal.dotEnumerator_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotGrExportPartHandler(Tekla.Structures.DrawingInternal.dotGrPart_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotGrExportPartAttributesHandler(Tekla.Structures.DrawingInternal.dotGrPartAttributes_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotGrExportBoltHandler(Tekla.Structures.DrawingInternal.dotGrBolt_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotGrExportBoltAttributesHandler(Tekla.Structures.DrawingInternal.dotGrBoltAttributes_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotGrExportEdgeChamferHandler(Tekla.Structures.DrawingInternal.dotGrEdgeChamfer_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotGrExportEdgeChamferAttributesHandler(Tekla.Structures.DrawingInternal.dotGrEdgeChamferAttributes_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotGrExportPourHandler(Tekla.Structures.DrawingInternal.dotGrPour_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotGrExportPourAttributesHandler(Tekla.Structures.DrawingInternal.dotGrPourAttributes_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotGrExportPourBreakHandler(Tekla.Structures.DrawingInternal.dotGrPourBreak_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotGrExportPourBreakAttributesHandler(Tekla.Structures.DrawingInternal.dotGrPourBreakAttributes_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotGrExportConnectionHandler(Tekla.Structures.DrawingInternal.dotGrConnection_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotGrExportSurfacingHandler(Tekla.Structures.DrawingInternal.dotGrSurfacing_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotGrExportSurfacingAttributesHandler(Tekla.Structures.DrawingInternal.dotGrSurfacingAttributes_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotGrExportWeldHandler(Tekla.Structures.DrawingInternal.dotGrWeld_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotGrExportWeldAttributesHandler(Tekla.Structures.DrawingInternal.dotGrWeldAttributes_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotGrExportWeldMarkHandler(Tekla.Structures.DrawingInternal.dotGrWeldMark_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotGrExportWeldMarkAttributesHandler(Tekla.Structures.DrawingInternal.dotGrWeldMarkAttributes_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotGrExportTextHandler(Tekla.Structures.DrawingInternal.dotGrText_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotGrExportTextAttributesHandler(Tekla.Structures.DrawingInternal.dotGrTextAttributes_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotGrExportPluginHandler(Tekla.Structures.DrawingInternal.dotGrPlugin_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotGrExportEmbeddedObjectHandler(Tekla.Structures.DrawingInternal.dotGrEmbeddedObject_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotGrExportEmbeddedObjectAttributesHandler(Tekla.Structures.DrawingInternal.dotGrEmbeddedObjectAttributes_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotGrExportReferenceModelHandler(Tekla.Structures.DrawingInternal.dotGrReferenceModel_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotGrExportReferenceModelAttributesHandler(Tekla.Structures.DrawingInternal.dotGrReferenceModelAttributes_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotGrExportTextFileHandler(Tekla.Structures.DrawingInternal.dotGrTextFile_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotGrExportTextFileAttributesHandler(Tekla.Structures.DrawingInternal.dotGrTextFileAttributes_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotGrExportLinkHandler(Tekla.Structures.DrawingInternal.dotGrLink_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotGrExportLinkAttributesHandler(Tekla.Structures.DrawingInternal.dotGrLinkAttributes_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotGrExportDrawingHandler(Tekla.Structures.DrawingInternal.dotGrDrawingAttributes_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotGrExportDrawingHandlerHandler(Tekla.Structures.DrawingInternal.dotGrDrawingHandler_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotGrExportGetIdsForDrawingsNeedingNumbering(Tekla.Structures.DrawingInternal.dotClientId_t)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotGrExportLayoutHandler(Tekla.Structures.DrawingInternal.dotGrLayoutHandler_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotGrExportMarkLearningHandler(Tekla.Structures.DrawingInternal.dotGrMarkLearningHandler_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotGrExportMarkListingHandler(Tekla.Structures.DrawingInternal.dotGrMarkListingHandler_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotGrExportOperationHandler(Tekla.Structures.DrawingInternal.dotGrOperationHandler_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotGrExportAssociativityHandler(Tekla.Structures.DrawingInternal.dotGrAssociativityHandler_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotGrExportCloningHandler(Tekla.Structures.DrawingInternal.dotGrCloningHandler_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotGrExportPrintDrawing(Tekla.Structures.DrawingInternal.dotGrPrintDrawing_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotGrExportUserPropertyHandler(Tekla.Structures.DrawingInternal.dotGrUserProperty_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotGrExportModelDatabaseUserPropertyHandler(Tekla.Structures.DrawingInternal.dotGrUserProperty_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotGrExportStraightDimensionHandler(Tekla.Structures.DrawingInternal.dotGrStraightDimension_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotGrExportStraightDimensionSetHandler(Tekla.Structures.DrawingInternal.dotGrStraightDimensionSet_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotGrExportStraightDimensionSetExcludePartsAccordingToFilter(Tekla.Structures.DrawingInternal.dotGrDrawingObject_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotGrExportDimensionLinkHandler(Tekla.Structures.DrawingInternal.dotGrDimensionLink_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotGrExportDrawingCheckerFetchCurrentDrawingErrors(System.Int32,System.Int32*@,System.Int32@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotGrExportStraightDimensionSetAttributesHandler(Tekla.Structures.DrawingInternal.dotGrStraightDimensionSetAttributes_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotGrExportAngleDimensionHandler(Tekla.Structures.DrawingInternal.dotGrAngleDimension_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotGrExportAngleDimensionAttributeHandler(Tekla.Structures.DrawingInternal.dotGrAngleDimensionAttributes_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotGrExportRadiusDimensionHandler(Tekla.Structures.DrawingInternal.dotGrRadiusDimension_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotGrExportRadiusDimensionAttributeHandler(Tekla.Structures.DrawingInternal.dotGrRadiusDimensionAttributes_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotGrExportCurvedDimensionRadialHandler(Tekla.Structures.DrawingInternal.dotGrCurvedDimensionRadial_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotGrExportCurvedDimensionSetRadialHandler(Tekla.Structures.DrawingInternal.dotGrCurvedDimensionSetRadial_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotGrExportCurvedDimensionSetRadialAttributesHandler(Tekla.Structures.DrawingInternal.dotGrCurvedDimensionSetRadialAttributes_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotGrExportCurvedDimensionOrthogonalHandler(Tekla.Structures.DrawingInternal.dotGrCurvedDimensionOrthogonal_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotGrExportCurvedDimensionSetOrthogonalHandler(Tekla.Structures.DrawingInternal.dotGrCurvedDimensionSetOrthogonal_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotGrExportCurvedDimensionSetOrthogonalAttributesHandler(Tekla.Structures.DrawingInternal.dotGrCurvedDimensionSetOrthogonalAttributes_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotGrExportMarkHandler(Tekla.Structures.DrawingInternal.dotGrMarkBase_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotExportGetColorIndexFromARGB(Tekla.Structures.DrawingInternal.dotARGBColor_t@)
ARGB: Color structure defining alpha, red, green, blue values.
Returns: TS globally unique color index.

Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotExportGetARGBFromColorIndex(System.Int32,Tekla.Structures.DrawingInternal.dotARGBColor_t@)
ColorIndex: TS globally unique color index.
ARGB: Color structure defining alpha, red, green, blue values.
Returns: true

Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotExportIsStandardColor(System.Int32)
ColorIndex: TS globally unique color index.
Returns: Non-zero value if the input color is a standard TS color. Zero if it is a user defined color

Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotExportGetColorIndexFromSaveFormat(System.String)
SaveFormat: Color save format (hex ie 0xFF140413 or TS color index).
Returns: Corresponding TS globally unique color index.

Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotExportGetSaveFormatFromColorIndex(System.Int32,System.Int32,System.Text.StringBuilder)
ColorIndex: TS globally unique color index.
MaxChars: Space allocated for SaveFormat variable.
SaveFormat: Color save format (hex ie 0xFF140413 or TS color index) output.
Returns: Void.

Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotGrExportGetAllColorPaletteFiles(Tekla.Structures.DrawingInternal.dotClientId_t)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotGrExportGetDrawingToObjectMapping(Tekla.Structures.DrawingInternal.dotClientId_t)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotGrExportMarkAttributesHandler(Tekla.Structures.DrawingInternal.dotGrMarkBaseAttributes_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotGrExportPickerHandler(Tekla.Structures.DrawingInternal.dotDrawingUIPicker_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotGrExportDrawingObjectSelectorHandler(Tekla.Structures.DrawingInternal.dotDrawingObjectSelector_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotGrExportViewAttributesHandler(Tekla.Structures.DrawingInternal.dotGrViewAttributes_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotGrGetDrawingViewVisibilityFilterValue(System.Int32,System.Char*@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotGrRaiseReadWindowsNamesByViewIdsCallback(System.Int32,System.Int32)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotGrExportSymbolHandler(Tekla.Structures.DrawingInternal.dotGrSymbol_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotGrExportSymbolAttributesHandler(Tekla.Structures.DrawingInternal.dotGrSymbolAttributes_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotGrExportLevelMarkHandler(Tekla.Structures.DrawingInternal.dotGrLevelMark_t@)
Function to handle .Net side requests about level marks
pLevelMark: .Net Level Mark
Returns: Result of request

Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotGrExportLevelMarkAttributesHandler(Tekla.Structures.DrawingInternal.dotGrLevelMarkAttributes_t@)
Function to handle .Net side requests about level mark attributes
pLevelMarkAttributes: .Net Level Mark Attributes
Returns: Result of request

Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotGrExportAutomationHandler(Tekla.Structures.DrawingInternal.dotGrAutomation_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotGrExportLeaderLineHandler(Tekla.Structures.DrawingInternal.dotGrLeaderLine_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotGrExportGetDotType(Tekla.Structures.DrawingInternal.dotGrDrawingObject_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotGrExportReinforcementHandler(Tekla.Structures.DrawingInternal.dotGrReinforcementBase_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotGrExportReinforcementSetGroupGetModelIdentifiers(Tekla.Structures.DrawingInternal.dotGrReinforcementSetGroupIdentifiers_t@,System.Int32*@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotGrExportReinforcementBaseAttributesHandler(Tekla.Structures.DrawingInternal.dotGrReinforcementBaseAttributes_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotGrExportAssociativityRuleHandler(Tekla.Structures.DrawingInternal.dotGrAssociativity_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotGrExportDetailMarkHandler(Tekla.Structures.DrawingInternal.dotGrDetailMark_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotGrExportDetailMarkAttributesHandler(Tekla.Structures.DrawingInternal.dotGrDetailMarkAttributes_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotGrExportSectionMarkHandler(Tekla.Structures.DrawingInternal.dotGrSectionMark_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotGrExportSectionMarkAttributesHandler(Tekla.Structures.DrawingInternal.dotGrSectionMarkAttributes_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotGrExportViewCommandHandler(Tekla.Structures.DrawingInternal.dotGrViewCommand_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotGrExportPluginQueueHandler(Tekla.Structures.DrawingInternal.dotGrPluginQueue_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotGrExportPickerCommandHandler(Tekla.Structures.DrawingInternal.dotGrPickerCommand_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotGrExportEnumerateCustomLineTypes(Tekla.Structures.DrawingInternal.dotGrCustomLineTypes_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotGrExportGetChangedDrawingForUpdatedEvent(Tekla.Structures.DrawingInternal.dotGrDrawingAttributes_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotGrExportSetDrawingPlotDateById(System.Int32)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotGrExportGetNextModelObjectIdentifier(System.Int32@,System.Int32)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotExportDisplayRevisionDialog


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotExportDisplayDrawingPropertiesDialog


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotExportArePoursShownInDrawing


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotExportDisplayDrawingUdaDialog


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotGrExportUpdateSelectedDrawings


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotGrExportUpdateSelectedDrawingMarks


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotGrExportRecreateSelectedDrawings


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotGrExportDeleteSelectedDrawings


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotExportDisplayDrawingCloningDialog


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotExportDisplaySnapshotsDialog


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotExportDisplaySnapshotDialogByFileName(System.String)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotExportDisplaySnapshotsDialogByGuid(System.String)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotGrExportAddToMasterDrawingCatalog


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotGrExportCopySelectedDrawingsToNewSheet


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotGrHighlightGridLine(System.Int32)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotGrUnhighlightGridLine(System.Int32)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotGrHighlightPartInView(System.Int32,System.Int32)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotGrUnhighlightPartInView(System.Int32,System.Int32)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotGrHighlightCutInView(System.Int32,System.Int32,System.Int32)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotGrUnhighlightCutInView(System.Int32)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotGrShowAssociativityPinPushed(System.Int32,System.Boolean)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotGrShowAssociativityPinUnpushed(System.Int32,System.Boolean)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotExportFilterDrawingListByParts


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotExportSignalDrawingSelectionChanged


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotExportSignalDocumentManagerClosed


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotGrExportTryOpenDrawing(System.Int32)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotGetNumberOfNonUpToDateObjectsAndPours


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotGrExportGetEditMode


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotGrExportGetDrawingExportFileName(System.Int32,System.String,System.String,System.Boolean,System.Boolean,System.Boolean,System.Text.StringBuilder)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotGrExportGetDrawingExportFileNameExt(System.Int32,System.String,System.String,System.Int32,System.Boolean,System.Boolean,System.Text.StringBuilder)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotGrExportSelectPartsByDrawings


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotGrExportGetDrawingsBySelectedParts(Tekla.Structures.DrawingInternal.dotClientId_t,System.Boolean,System.Boolean)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotGrExportSetColorRgb(System.Int32,System.Byte,System.Byte,System.Byte)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotGrExportSetPenWidth(System.Int32,System.Int32)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotGrExportRefreshColorMode


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotGrExportGetDrawingReadyForIssuingChangeEvent(System.Text.StringBuilder)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotdiaLoadAttributeFileNameToDialogAndApply(System.String,System.String)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotdiaLoadAttributeFileNameToDialogAndModify(System.String,System.String)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotExportShowColorPalette(System.Int32,System.IntPtr)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotExportShowColorPaletteForHatchBackground(System.Int32,System.IntPtr)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotGrExportGetPluginInputById(System.Int32,Tekla.Structures.DrawingInternal.dotPluginInput_t@)


Tekla.Structures.DrawingInternal.CDelegateSynchronized.dotGetDrawingRuntimeIdFromFilename(System.String)
